Bunkering_02/0.orig/H2
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2406                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    right               { type inletOutlet; inletValue uniform 0; value $internalField; }
    left                { type inletOutlet; inletValue uniform 0; value $internalField; }
    front               { type inletOutlet; inletValue uniform 0; value $internalField; }
    back                { type inletOutlet; inletValue uniform 0; value $internalField; }
    top                 { type inletOutlet; inletValue uniform 0; value $internalField; }
    bottom              { type zeroGradient; }
    bunkering-boat_m    { type zeroGradient; }
    bunkering-quay_m    { type zeroGradient; }
    nozzle_holder_wall  { type zeroGradient; }
    nozzle              { type fixedValue; value uniform 1; }
}
// ************************************************************************* //
