Bunkering_02/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    left
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    front
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    back
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    bottom
    {
        type            noSlip;
    }
    bunkering-boat_m
    {
        type            noSlip;
    }
    bunkering-quay_m
    {
        type            noSlip;
    }
    nozzle_holder_wall
    {
        type            noSlip;
    }
    nozzle
    {
        type            codedFixedValue;
        value           uniform (0 0 0);     // dummy

        name    rampInletVelocity;

        code
        #{
            const fvPatch& patch = this->patch();
            const scalar t = this->db().time().value();

            // User parameters:
            const scalar Umax = 20; //1630;         // final velocity
            const scalar t_ramp = 0.01;       // ramp time (seconds)

            scalar scale = min(1.0, t / t_ramp);

            forAll(patch, faceI)
            {
                // direction assumed x-axis, adjust to your nozzle direction
                operator[](faceI) = vector(Umax * scale, 0, 0);
            }
        #};
    }
}
// ************************************************************************* //
